In [ ]:
Data Frame : 2차원 데이터 구조

In [ ]:
 생성 - list를 통한 생성

In [3]:
import pandas as pd 

pd.DataFrame([[1,2,3],
            [4,5,6],
            [7,8,9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
컬럼명 지정

In [4]:
pd.DataFrame([[1,2,3],
             [4,5,6],
             [7,8,9]], columns=['가','나','다'])

   가  나  다
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
dictionary를 통한 Data Frame 생성 >> key값이 자동으로 column명으로 지정

In [5]:
# data라는 딕셔너리 생성
data = {
    'name':['Kim','Lee','Park'],
    'age':[24,27,34],
    'children':[2,1,3]
}

In [8]:
# DataFrame에 data라는 딕셔너리 넣으면 자동 완성
df = pd.DataFrame(data)

In [7]:
pd.DataFrame(data).T

            0    1     2
name      Kim  Lee  Park
age        24   27    34
children    2    1     3

In [9]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [10]:
df.columns

Index(['name', 'age', 'children'], dtype='object')

In [11]:
df.values

array([['Kim', 24, 2],
       ['Lee', 27, 1],
       ['Park', 34, 3]], dtype=object)

In [12]:
df.dtypes

name        object
age          int64
children     int64
dtype: object

In [ ]:
index 지정하는 법

In [13]:
df.index = list('abc')
df

   name  age  children
a   Kim   24         2
b   Lee   27         1
c  Park   34         3

In [14]:
df['name'] # 컬럼명으로 컬럼 선택 가능 >> Series로 나옴

a     Kim
b     Lee
c    Park
Name: name, dtype: object

In [15]:
type(df['name'])

pandas.core.series.Series

In [16]:
df[['name','children']]

   name  children
a   Kim         2
b   Lee         1
c  Park         3

In [ ]:
***** 컬럼명 변경 *****

In [19]:
df.rename(columns={'name':'이름'}, inplace=True)
df

     이름  age  children
a   Kim   24         2
b   Lee   27         1
c  Park   34         3

In [ ]:
예제

In [ ]:
1. DataFrame 생성 df 변수에 할당

In [20]:
import pandas as pd

food = {'food':['KFC','McDonald','SchoolFood'],
       'price':[1000,2000,2500],
       'rating':[4.5,3.9,4.2]}

df = pd.DataFrame(food)
df

         food  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  SchoolFood   2500     4.2

In [ ]:
2. food 컬럼과 rating컬럼만 선택해 출력

In [21]:
df[['food','rating']]

         food  rating
0         KFC     4.5
1    McDonald     3.9
2  SchoolFood     4.2

In [ ]:
3. food 컬럼명 place 컬럼명으로 변경********************

In [23]:
df.rename(columns={'food':'place'})
df

         food  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  SchoolFood   2500     4.2

In [24]:
df.rename(columns={'food':'place'}, inplace=True)
df

        place  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  SchoolFood   2500     4.2